Управление_пожарной_частью_/src/Documents/СписаниеВещевогоИмущества/СписаниеВещевогоИмущества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеВещевогоИмущества</name>
  <registerRecords>AccumulationRegister.ВещевоеИмуществоСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВещевоеИмущество</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>EnumRef.РазмерОдежды</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/AccumulationRegisters/ВещевоеИмуществоСотрудников/ВещевоеИмуществоСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВещевоеИмуществоСотрудников</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Размер</name>
    <type>
      <types>EnumRef.РазмерОдежды</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_пожарной_частью_/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Размер</name>
    <type>
      <types>EnumRef.РазмерОдежды</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_пожарной_частью_/src/Documents/СписаниеСоСклада/СписаниеСоСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеСоСклада</name>
  <basedOn>Document.СписаниеВещевогоИмущества</basedOn>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВещевоеИмущество</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>EnumRef.РазмерОдежды</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/Documents/СписаниеВещевогоИмущества/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ВещевоеИмуществоСотрудников
	Движения.ВещевоеИмуществоСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаВещевоеИмущетво из ВещевоеИмущество Цикл
		Движение = Движения.ВещевоеИмуществоСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Организация = Организация;
		Движение.Склад = Склад;
		Движение.ФизическоеЛицо = ФизическоеЛицо;
		Движение.Номенклатура = ТекСтрокаВещевоеИмущетво.Номенклатура;
		Движение.Размер = ТекСтрокаВещевоеИмущетво.Размер;
		Движение.Количество = ТекСтрокаВещевоеИмущетво.Количество;
	КонецЦикла;

	// регистр ТоварыНаСкладах
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаВещевоеИмущетво из ВещевоеИмущество Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Организация = Организация;
		Движение.Склад = Склад;
		Движение.Номенклатура = ТекСтрокаВещевоеИмущетво.Номенклатура;
		Движение.Размер = ТекСтрокаВещевоеИмущетво.Размер;
		Движение.Количество = ТекСтрокаВещевоеИмущетво.Количество;
	КонецЦикла;
КонецПроцедуры

Процедура ПриПроведении(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    СписаниеСоСклада.Ссылка
	|ИЗ
	|    Документ.СписаниеСоСклада КАК СписаниеСоСклада
	|ГДЕ
	|    СписаниеСоСклада.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ДокСписаниеСоСклада = Документы.СписаниеСоСклада.СоздатьДокумент();
	
	ДокСписаниеСоСклада.Дата = Дата;
	ДокСписаниеСоСклада.Организация = Организация;
	ДокСписаниеСоСклада.Склад = Склад;
	ДокСписаниеСоСклада.ДокументОснование = Ссылка;
	ДокСписаниеСоСклада.Комментарий = "Списание по документу " + Номер + " от " + Формат(Дата, "ДЛФ=Д");
	
	ДокСписаниеСоСклада.ВещевоеИмущество.Очистить();
	
	Для Каждого СтрокаТЧ Из ВещевоеИмущество Цикл
		НоваяСтрока = ДокСписаниеСоСклада.ВещевоеИмущество.Добавить();
		НоваяСтрока.Номенклатура = СтрокаТЧ.Номенклатура;
		НоваяСтрока.Количество = СтрокаТЧ.Количество;
		НоваяСтрока.Размер = СтрокаТЧ.Размер;
	КонецЦикла;
	
	ДокСписаниеСоСклада.Записать(РежимЗаписиДокумента.Проведение);	
КонецПроцедуры
